print('Задача 1. Кубы чисел')

# Любителю математики Паше снова стало мало распечатанных табличек,
# включая последнюю со степенями двойки.
# Теперь он хочет взять третью степень чисел от 1 до абсолютно любого!

# Напишите программу,
# которая возводит в третью степень каждое число от 1 до N
# и выводит результат на экран.

num = int(input('enter last number: '))

n = 1

while n <= num:
  res = n ** 3
  print(f'{n}^3 = {res}')
  n += 1
