print('Задача 6. Поставьте оценку!')

# Вася выложил своё новое приложение на платформу для начинающих разработчиков,
# на ней пользователи могут ставить оценку приложению от −100 до 100.
# Ему захотелось сравнить количество положительных и отрицательных отзывов,
# для этого он заранее отфильтровал все отзывы так,
# чтобы в конце были те, которые равны нулю.

# Напишите программу,
# которая находит количество положительных
# и количество отрицательных чисел в последовательности.
# Последовательность заканчивается на числе 0.

# Пример:
# Введите число: −4
# Введите число: −90
# Введите число: 6
# Введите число: 0
# Кол-во положительных чисел: 1
# Кол-во отрицательных чисел: 2


num = int(input('enter the number: '))
count_pos = 0
count_neg = 0
while num != 0:
    if 0 < num <= 100:
        count_pos += 1
    elif -100 <= num < 0:
        count_neg += 1
    num = int(input('enter the number: '))
print(f'positive review - {count_pos}, negative review - {count_neg}')