print('Задача 3. Это будет бомба')

# Мы разрабатываем пошаговую игру по мотивам боевика.
# Игрок - главный герой и должен обезвредить бомбу, которая взорвётся через N секунд.
# Программа спрашивает пользователя хочет ли он обезвредить бомбу сейчас.
#
# Если ответ “0” (то есть “нет”), то счетчик бомбы уменьшается.
# Если он достиг нуля, то программа выдаёт сообщение “Бомба взорвалась”,
# а если не достиг, то программа вновь переспрашивает,
# не хочет ли игрок обезвредить бомбу, и сообщает, сколько времени осталось до взрыва..
#
# Если ответ “да”, то программа выводит на экран сообщение о том,
# что бомба обезврежена и сколько секунд оставалось до взрыва.
# Используйте цикл for.

timer = int(input('bomb has been plant: '))
print()
for i in range(timer, 0, -1):
  print(f'explosion after {i} seconds..')
  print(f'defuse a bomb? 1 -yes/0 - no')
  decid = int(input('..'))
  if decid == 1:
    print(f'bomb has been defused on {i}sec! You alive!')
    break
  print()
print('the bomb exploded!! You dead!')

