suits = ['червей', 'бубей', 'крестей', 'пик']

ranks = {
     'двойка': 2,
     'тройка': 3,
     'четвёрка': 4,
     'пятёрка': 5,
     'шестёрка': 6,
     'семёрка': 7,
     'восьмёрка': 8,
     'девятка': 9,
     'десятка': 10,
     'валет': 10,
     'дама': 10,
     'король': 10,
     'туз': 11
}

MESSAGES = {
    'ask_start': 'Want to play?(y/n) ',
    'ask_card': 'Еще карту?(y/n) ',
    'win': '{} выиграл',
    'lose': '{} проиграл',
    'drawn': 'ничья в игре',
    'rerun': 'Wanna play again?(y/n)'
}

